---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralConnectionType
source: html/e3b74cf3-71d8-a230-7fb6-0fdc4c81fca2.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionType

A type element that represents a connection symbol applied to structural members.

## Syntax (C#)
```csharp
public class StructuralConnectionType : ElementType
```